handling missing values

Dropping columns

In [1]:
import pyspark

In [2]:
from pyspark.sql import SparkSession

In [3]:
spark=SparkSession.builder.appName('Practice').getOrCreate()

In [84]:
df=spark.read.csv('test1.csv',header=True,inferSchema=True)
df.show()
df.printSchema()

+---------+----+----------+------+
|     Name| age|experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

Dropping column

In [17]:
df.drop('Name').show() # droping Name column

+----+----------+------+
| age|experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|NULL|      NULL| 40000|
|  34|        10| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

    Dropping  row

In [19]:
df.na.drop().show() # it will delete all row having Null value and by default value of How is Any

+---------+---+----------+------+
|     Name|age|experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [20]:
#how=any
df.na.drop(how='any').show() # it will dellete all row having at least one NULL

+---------+---+----------+------+
|     Name|age|experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [21]:
#how=all
df.na.drop(how='all').show()# it will delete only those row having all value NULL

+---------+----+----------+------+
|     Name| age|experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [34]:
#thresold = it will drop all rows having less no of not null value that thres value
#his takes int value, Drop rows that have less than thresh hold non-null values. Default is 'None'.
df.na.drop(how='any',thresh=2).show()

+---------+----+----------+------+
|     Name| age|experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

subset argument

In [38]:
#subset :- it is used to remove such rows having null value in the specified column of subset
# here it will deleete the row having experience value  as null we can give more than one value to subsets
df.na.drop(how='any',subset=['experience']).show()

+---------+---+----------+------+
|     Name|age|experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

Filling the missing value

In [60]:
# filling the missing value
df.na.fill('HI').show() # since i have used inferschema =True so it will replcae only those value having same data type
# here it's replacing only such value whose data type is string

+---------+----+----------+------+
|     Name| age|experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   mahesh|NULL|      NULL| 40000|
|       HI|  34|        10| 38000|
|       HI|  36|      NULL|  NULL|
+---------+----+----------+------+

In [62]:
df.na.fill(654656446).show() # IT WILL FILL ONLY INTEGER VALUE WITH 20

+---------+---------+----------+---------+
|     Name|      age|experience|   Salary|
+---------+---------+----------+---------+
|    Krish|       31|        10|    30000|
|Sudhanshu|       30|         8|    25000|
|    Sunny|       29|         4|    20000|
|     Paul|       24|         3|    20000|
|   harsha|       21|         1|    15000|
|  Shubham|       23|         2|    18000|
|   mahesh|654656446| 654656446|    40000|
|     NULL|       34|        10|    38000|
|     NULL|       36| 654656446|654656446|
+---------+---------+----------+---------+

In [71]:
df.na.fill({'Name':'Missing Str value','age':6546,'experience':54654}).show()  # filling values in differnet column seperately

+-----------------+----+----------+------+
|             Name| age|experience|Salary|
+-----------------+----+----------+------+
|            Krish|  31|        10| 30000|
|        Sudhanshu|  30|         8| 25000|
|            Sunny|  29|         4| 20000|
|             Paul|  24|         3| 20000|
|           harsha|  21|         1| 15000|
|          Shubham|  23|         2| 18000|
|           mahesh|6546|     54654| 40000|
|Missing Str value|  34|        10| 38000|
|Missing Str value|  36|     54654|  NULL|
+-----------------+----+----------+------+

In [74]:
df.na.fill('Missing value',['Name','age']).show() # it will fill Missng value of the Name or any specified  column
                                            # its not changing due to diffrenet data types
                                            # if we will not use inferSchema than it will work

+-------------+----+----------+------+
|         Name| age|experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       mahesh|NULL|      NULL| 40000|
|Missing value|  34|        10| 38000|
|Missing value|  36|      NULL|  NULL|
+-------------+----+----------+------+

# filling missing value with mean/median/mode   using IMPUTER

In [85]:
#filling with mean value
from pyspark.ml.feature import Imputer
imputer=Imputer(inputCols=['age','experience','Salary'],outputCols=["{}_imputed".format(c) for c in ['age','experience','Salary']]).setStrategy('mean')

In [86]:
imputer.fit(df).transform(df).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|experience|Salary|age_imputed|experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   mahesh|NULL|      NULL| 40000|         28|                 5|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 5|         25750|
+---------+----+----------+------+-----------+------------------+--------------+

In [88]:
#filling with median value
from pyspark.ml.feature import Imputer
imputer=Imputer(inputCols=['age','experience','Salary'],outputCols=["{}_imputed".format(c) for c in ['age','experience','Salary']]).setStrategy('median')

In [89]:
imputer.fit(df).transform(df).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|experience|Salary|age_imputed|experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   mahesh|NULL|      NULL| 40000|         29|                 4|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 4|         20000|
+---------+----+----------+------+-----------+------------------+--------------+

In [91]:
#filling with mode value
from pyspark.ml.feature import Imputer
imputer=Imputer(inputCols=['age','experience','Salary'],outputCols=["{}_imputed".format(c) for c in ['age','experience','Salary']]).setStrategy('mode')

In [92]:
imputer.fit(df).transform(df).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|experience|Salary|age_imputed|experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   mahesh|NULL|      NULL| 40000|         21|                10|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                10|         20000|
+---------+----+----------+------+-----------+------------------+--------------+